In [94]:
select * from student

+------+---------+-----------+------------+--------+-----------+
| id   | name    | last_name | birthdate  | gender | city      |
+------+---------+-----------+------------+--------+-----------+
| 4401 | Christ  | Fisher    | 2000-01-20 | Male   | Cape town |
+------+---------+-----------+------------+--------+-----------+
| 4402 | Chaerle | Walke     | 1989-05-01 | Male   | Wymberg   |
+------+---------+-----------+------------+--------+-----------+
| 4403 | John    | Talovam   | 1990-01-7  | Male   | Cape town |
+------+---------+-----------+------------+--------+-----------+
| 4404 | Helene  | Tambwe    | 1999-07-12 | Female | Toronto   |
+------+---------+-----------+------------+--------+-----------+
| 4405 | Ashley  | Johnson   | 1994-04-11 | Male   | Albany    |
+------+---------+-----------+------------+--------+-----------+
| 4406 | Janice  | Rocky     | 1997-03-17 | Female | Paris     |
+------+---------+-----------+------------+--------+-----------+
| 4407 | Zoe     | Kab       | 2000-05-22 | Female | New york  |
+------+---------+-----------+------------+--------+-----------+
| 4408 | Sarah   | Monro     | 2003-04-05 | Female | Montreal  |
+------+---------+-----------+------------+--------+-----------+
| 4409 | William | Peterson  | 1998-09-29 | Male   | Chicago   |
+------+---------+-----------+------------+--------+-----------+
| 4410 | Matthew | Josue     | 2005-06-20 | Male   | Texas     |
+------+---------+-----------+------------+--------+-----------+

In [122]:
select * from score

+-----------+------------------+-----------+-------+
| course_id | email            | continent | score |
+-----------+------------------+-----------+-------+
| 501       | info@hou.com     | Africa    | 69    |
+-----------+------------------+-----------+-------+
| 502       | indf@gmail.com   | Africa    | 73    |
+-----------+------------------+-----------+-------+
| 503       | info@gmail.com   | Africa    | 89    |
+-----------+------------------+-----------+-------+
| 504       | ghs@hahoo.com    | Canada    | 75    |
+-----------+------------------+-----------+-------+
| 505       | yull@gmail.com   | USA       | 87    |
+-----------+------------------+-----------+-------+
| 506       | info@outlook.com | Europ     | 79    |
+-----------+------------------+-----------+-------+
| 507       | ind@gmail.com    | USA       | 77    |
+-----------+------------------+-----------+-------+
| 508       | mai@gmai.com     | Canada    | 86    |
+-----------+------------------+-----------+-------+
| 509       | info@out.com     | USA       | 81    |
+-----------+------------------+-----------+-------+
| 510       | info@gmail.com   | USA       | 78    |
+-----------+------------------+-----------+-------+

In [121]:
select * from course

+------+-----+------------------+-------+-----------+
| id   | age | course           | fees  | course_id |
+------+-----+------------------+-------+-----------+
| 4401 | 23  | Data science     | 17000 | 501       |
+------+-----+------------------+-------+-----------+
| 4402 | 34  | Statistic        | 15000 | 502       |
+------+-----+------------------+-------+-----------+
| 4403 | 33  | Statistic        | 9800  | 503       |
+------+-----+------------------+-------+-----------+
| 4404 | 24  | Data analytics   | 15000 | 504       |
+------+-----+------------------+-------+-----------+
| 4405 | 29  | Data mining      | 12000 | 505       |
+------+-----+------------------+-------+-----------+
| 4406 | 26  | Data science     | 11500 | 506       |
+------+-----+------------------+-------+-----------+
| 4407 | 22  | Data science     | 17800 | 507       |
+------+-----+------------------+-------+-----------+
| 4408 | 20  | Programming      | 8500  | 508       |
+------+-----+------------------+-------+-----------+
| 4409 | 25  | Data analytics   | 10500 | 509       |
+------+-----+------------------+-------+-----------+
| 4410 | 18  | Data engeneering | 11800 | 510       |
+------+-----+------------------+-------+-----------+

In [97]:
SELECT COUNT(distinct st.id) as student_id,
       COUNT(distinct sc.continent) as continent,
       COUNT(distinct st.city) as city,
       COUNT(distinct co.course) as course
        
FROM student as st
JOIN course as co ON st.id = co.id
LEFT JOIN score as sc ON sc.course_id = co.course_id

+------------+-----------+------+--------+
| student_id | continent | city | course |
+------------+-----------+------+--------+
| 10         | 4         | 9    | 7      |
+------------+-----------+------+--------+

In [98]:
--which continent having most of the student?

SELECT continent,
COUNT(continent) as COUNT
FROM score
GROUP BY continent 
HAVING count(continent) > 1

+-----------+-------+
| continent | COUNT |
+-----------+-------+
| Africa    | 3     |
+-----------+-------+
| Canada    | 2     |
+-----------+-------+
| USA       | 4     |
+-----------+-------+

In [116]:
-- what's the average score of studend
SELECT 
     ROUND(AVG(score),2) as AVG_score
FROM score

+-----------+
| AVG_score |
+-----------+
| 79.4      |
+-----------+

In [117]:
--Average score per continent

SELECT sc.continent,
     ROUND(AVG(sc.score),2) as AVG_score
FROM student as st
JOIN course as co ON st.id = co.id
LEFT JOIN score as sc ON sc.course_id = co.course_id
GROUP BY sc.continent
ORDER BY AVG_score DESC
-- Student from US are on the  top list of student with high score

+-----------+-----------+
| continent | AVG_score |
+-----------+-----------+
| USA       | 80.75     |
+-----------+-----------+
| Canada    | 80.5      |
+-----------+-----------+
| Europ     | 79.0      |
+-----------+-----------+
| Africa    | 77.0      |
+-----------+-----------+

In [144]:
--- Let's manupilate the cte statement and see the performance of the student with case statement


WITH cte AS (SELECT st.name, st.last_name, co.course,
	   CASE WHEN sc.score = 90 then 'A+'
		WHEN sc.score between 80 and 90 Then 'A'
		WHEN sc.score between 70 and 80 then 'B'
		ELSE 'C' END AS performance
FROM student as st
JOIN course as co
ON st.id = co.id
LEFT JOIN score as sc
ON sc.course_id = co.course_id)

SELECT  *
FROM cte
WHERE performance = 'A'

+---------+-----------+----------------+-------------+
| name    | last_name | course         | performance |
+---------+-----------+----------------+-------------+
| John    | Talovam   | Statistic      | A           |
+---------+-----------+----------------+-------------+
| Ashley  | Johnson   | Data mining    | A           |
+---------+-----------+----------------+-------------+
| Sarah   | Monro     | Programming    | A           |
+---------+-----------+----------------+-------------+
| William | Peterson  | Data analytics | A           |
+---------+-----------+----------------+-------------+

In [145]:
--- student with score above the average

SELECT st.name, st.last_name, sc.score
      FROM student as st
JOIN course as co ON co.id = st.id
LEFT JOIN score sc ON sc.course_id = co.course_id
WHERE score > (SELECT AVG(sc.score) from score AS sc)

+---------+-----------+-------+
| name    | last_name | score |
+---------+-----------+-------+
| John    | Talovam   | 89    |
+---------+-----------+-------+
| Ashley  | Johnson   | 87    |
+---------+-----------+-------+
| Sarah   | Monro     | 86    |
+---------+-----------+-------+
| William | Peterson  | 81    |
+---------+-----------+-------+

In [146]:
---what's the avg COURSE fees per continent

SELECT sc.continent,
     ROUND(AVG(co.fees),2) as AVG_Fees
FROM student as st
JOIN course as co ON st.id = co.id
LEFT JOIN score as sc ON sc.course_id = co.course_id
GROUP BY sc.continent
ORDER BY AVG_Fees DESC

+-----------+----------+
| continent | AVG_Fees |
+-----------+----------+
| Africa    | 13933.33 |
+-----------+----------+
| USA       | 13025.0  |
+-----------+----------+
| Canada    | 11750.0  |
+-----------+----------+
| Europ     | 11500.0  |
+-----------+----------+

In [147]:
SELECT st.name, st.last_name, sc.score, co.fees
      FROM student as st
JOIN course as co ON co.id = st.id
LEFT JOIN score sc ON sc.course_id = co.course_id
WHERE score > (SELECT AVG(sc.score) from score AS sc)

+---------+-----------+-------+-------+
| name    | last_name | score | fees  |
+---------+-----------+-------+-------+
| John    | Talovam   | 89    | 9800  |
+---------+-----------+-------+-------+
| Ashley  | Johnson   | 87    | 12000 |
+---------+-----------+-------+-------+
| Sarah   | Monro     | 86    | 8500  |
+---------+-----------+-------+-------+
| William | Peterson  | 81    | 10500 |
+---------+-----------+-------+-------+

In [149]:
---what's the avg COURSE fees per continent

SELECT co.course,
     ROUND(AVG(co.fees),2) as AVG_Fees
FROM student as st
JOIN course as co ON st.id = co.id
LEFT JOIN score as sc ON sc.course_id = co.course_id
GROUP BY co.course
ORDER BY AVG_Fees DESC

+------------------+----------+
| course           | AVG_Fees |
+------------------+----------+
| Data science     | 17400.0  |
+------------------+----------+
| Data analytics   | 12750.0  |
+------------------+----------+
| Statistic        | 12400.0  |
+------------------+----------+
| Data mining      | 12000.0  |
+------------------+----------+
| Data engeneering | 11800.0  |
+------------------+----------+
| Data science     | 11500.0  |
+------------------+----------+
| Programming      | 8500.0   |
+------------------+----------+

In [163]:
SELECT co.course,
     ROUND(MIN(co.fees),2) as MIN_Fees,
     ROUND(AVG(co.fees),2) as AVG_Fees,
     ROUND(MAX(co.fees),2) as MAX_Fees
FROM student as st
JOIN course as co ON st.id = co.id
LEFT JOIN score as sc ON sc.course_id = co.course_id
where
    co.course in (select *
                      FROM course as co
                        where course like "%Data%")

Error: sub-select returns 5 columns - expected 1

In [164]:
select *
  FROM course 
where course like "%Data%"

+------+-----+------------------+-------+-----------+
| id   | age | course           | fees  | course_id |
+------+-----+------------------+-------+-----------+
| 4401 | 23  | Data science     | 17000 | 501       |
+------+-----+------------------+-------+-----------+
| 4404 | 24  | Data analytics   | 15000 | 504       |
+------+-----+------------------+-------+-----------+
| 4405 | 29  | Data mining      | 12000 | 505       |
+------+-----+------------------+-------+-----------+
| 4406 | 26  | Data science     | 11500 | 506       |
+------+-----+------------------+-------+-----------+
| 4407 | 22  | Data science     | 17800 | 507       |
+------+-----+------------------+-------+-----------+
| 4409 | 25  | Data analytics   | 10500 | 509       |
+------+-----+------------------+-------+-----------+
| 4410 | 18  | Data engeneering | 11800 | 510       |
+------+-----+------------------+-------+-----------+